app/views/active_admin/home.html.erb

						<ul class="list-group">
						  <li class="list-group-item"><span style="font-family: 'Karla',sans-serif; color: #072c61;">Projects Completed</span><span class="badge"><%=current_admin.complete_projects.count%></span></li>
---
SELECT "complete_projects".* FROM "complete_projects" WHERE "complete_projects"."admin_id" = ?  [["admin_id", 1]]
SELECT COUNT(*) FROM "complete_projects" WHERE "complete_projects"."admin_id" = ?  [["admin_id", 1]]