app/controllers/active_admin_controller.rb

  def home

  	#ongoing projects
    relations = ProjectUserAdminRelation.where(admin_id: current_admin.id)
    projectIds=[]
    relations.each do |r|
      projectIds<<r.SelectedProject_id
    end
    @ongoingProjects=SelectedProject.where(id:projectIds).reverse

    #completed projects
    complete=CompleteProject.where(Admin_id: current_admin.id)
---
SELECT "project_user_admin_relations".* FROM "project_user_admin_relations" WHERE "project_user_admin_relations"."admin_id" = ?  [["admin_id", 1]]
SELECT "complete_projects".* FROM "complete_projects" WHERE "complete_projects"."admin_id" = ?  [["admin_id", 1]]