app/controllers/active_user_controller.rb

UPDATE "users" SET "profile_pic" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_pic", "/image.jpg"], ["updated_at", "2018-02-06 18:20:42.928590"], ["id", 1]]
SELECT COUNT(*) FROM "admins" WHERE "admins"."division" = ?  [["division", "Instrumentation"]]
SELECT "project_user_admin_relations".* FROM "project_user_admin_relations" WHERE (user_id1='1' OR user_id2='1' OR user_id3='1' OR user_id4='1' OR user_id5='1')
SELECT "complete_projects".* FROM "complete_projects" WHERE (user1='1' OR user2='1' OR user3='1' OR user4='1' OR user5='1')
SELECT "selected_projects".* FROM "selected_projects" WHERE 1=0
---
  def home

    if !current_user.profile_pic
      current_user.profile_pic = '/image.jpg'
      current_user.save!
    end

  	@countInstrumentation=Admin.where(division:"Instrumentation").count
  	@countAutomation=Admin.where(division:"Automation").count

    # finding all the ongoing projects in which current_user is involved
    users = ProjectUserAdminRelation.where("user_id1=? OR user_id2=? OR user_id3=? OR user_id4=? OR user_id5=?",
      current_user.id,current_user.id,current_user.id,current_user.id,current_user.id)
    s_projectIds = []
    users.each do|project|
      s_projectIds<<project.SelectedProject_id
    end
    @selectedProjects=SelectedProject.where(id:s_projectIds)

    # finding all the completed projects in which current_user is involved
    users = CompleteProject.where("user1=? OR user2=? OR user3=? OR user4=? OR user5=?",current_user.id,
      current_user.id,current_user.id,current_user.id,current_user.id)
    c_projectIds = []
    users.each do|project|
      c_projectIds<<project.SelectedProject_id
    end
    @completedProjects=SelectedProject.where(id:c_projectIds)

    # finding all projects
    @allProjects = []
    @selectedProjects.each do|project|

SELECT "user_task_relations".* FROM "user_task_relations" WHERE "user_task_relations"."user_id" = ?  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
    @allProjects.shuffle!

    # finding all the tasks in which current_user is involved
    users = UserTaskRelation.where(user_id:current_user.id)
    task_ids = []
    users.each do|t|

SELECT COUNT(*) FROM "admins" WHERE "admins"."division" = ?  [["division", "Instrumentation"]]
SELECT "admins".* FROM "admins" WHERE "admins"."division" = ?  ORDER BY "admins"."id" ASC  [["division", "Instrumentation"]]
---
  def facultyIndex
    @countInstrumentation=Admin.where(division:"Instrumentation").count
    @countAutomation=Admin.where(division:"Automation").count
  	@division=params[:division]
	  @faculty=Admin.where(:division=>@division)

SELECT COUNT(*) FROM "admins" WHERE "admins"."division" = ?  [["division", "Instrumentation"]]
SELECT  "admins".* FROM "admins" WHERE "admins"."name" = ?  ORDER BY "admins"."id" ASC LIMIT 1  [["name", "ABCD"]]
SELECT "project_user_admin_relations".* FROM "project_user_admin_relations" WHERE "project_user_admin_relations"."admin_id" = ?  [["admin_id", 1]]
SELECT  "eligibilities".* FROM "eligibilities" WHERE "eligibilities"."faculty_name" = ? LIMIT 1  [["faculty_name", "ABCD"]]
---
  def facultyShow
    @countInstrumentation=Admin.where(division:"Instrumentation").count
    @countAutomation=Admin.where(division:"Automation").count
    @name=params[:name]
	  @faculty=Admin.where(:name=>@name).first

    @faculty.AOI.gsub!(/<br>()/,',')

    @interests = @faculty.AOI.split(',')
    @interests.delete('and')
    @interests.delete('&')

    @projects = []
    @ids = []
    selectedProjects = ProjectUserAdminRelation.where(admin_id: @faculty.id)

    selectedProjects.each do|project|
      @ids<<project.SelectedProject_id
    end

    @ids.each do|id|
      @projects<<SelectedProject.find_by_id(id)
    end
    @projects = @projects[0,10]
    @eligibility = Eligibility.find_by_faculty_name(@name)

SELECT COUNT(*) FROM "admins" WHERE "admins"."division" = ?  [["division", "Instrumentation"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def profile
    @countInstrumentation=Admin.where(division:"Instrumentation").count
    @countAutomation=Admin.where(division:"Automation").count
    @user=User.find_by_id(params[:id])

SELECT COUNT(*) FROM "admins" WHERE "admins"."division" = ?  [["division", "Instrumentation"]]
---
  def edit_profile
    @countInstrumentation=Admin.where(division:"Instrumentation").count