app/controllers/tasks_controller.rb

SELECT COUNT(*) FROM "admins" WHERE "admins"."division" = ?  [["division", "Instrumentation"]]
SELECT "users".* FROM "users"
---
	def new
    @countInstrumentation=Admin.where(division:"Instrumentation").count
    @countAutomation=Admin.where(division:"Automation").count
    @email=params[:email]    #faculty email
		@task=Task.new
    @email_ids = []

    User.all.each do|user|